
    const cytaty = [{
        cytata:`"Не понтуйтеся пацани, дівчата люблять у вас простату"`
    }, {
        cytata:`"Когда ти тєряеш любовь всєй жизні, вже нє важно 13 тобі, 14, 39 або 80. Тобі буде больно до кінця жизні"`
    }, {
        cytata:`"Нє ми такіє, жизнь такая"`
    }, {
        cytata:`"В жизні надо бить упертим, но нє бараном"`
    }, {
        cytata:`"Нє важно хто навпроти, важно хто рядом"`
    }, {
        cytata:`"Секрет моїх щасливих отношеній в тому, шо їх нема"`
    }, {
        cytata:`"Вдягни посмішку, бейба, і вперед."`
    }, {
        cytata:`"Гроші теж страждають, від того, що у них нема мене"`
    }, {
        cytata:`"Я раніма як роза, но твоя кров може пролитись із-за моїх шипів"`
    }, {
        cytata:`"Якщо Бог мені Суддя, тоді диявол – адвокат"`
    }, {
        cytata:`"Твій понт оправдан, коли ти сам себе зробив"`
    }, {
        cytata:`"Якщо вас не заслужено обідєли, поверниться и заслужіть"`
    }, {
        cytata:`"Коли судьба звела вас зі мною, то прийшов ваш час платить за свої гріхи"`
    }, {
        cytata:`"Ти зі мною не справишся, навіть якщо у тебе є інструкція"`
    }, {
        cytata:`"Я впевнена, що я принцеса з мультфильму, яку ще не встигли вигадати"`
    }, {
        cytata:`"Щасливими треба буть вже зараз, бо це і є життя!"`
    }, {
        cytata:`"Отвєчаю рєзко! Посилаю дєрзко! Кому не нравітся, тот свободєн!"`
    }, {
        cytata:`"Моє життя — це тьма. Для мене погас свєт. Просто я люблю, а він меня «нєт»."`
    }, {
        cytata:`"Якшо шо – ваше мненіє давно вже на сміттєзвалищі"`
    }, {
        cytata:`"Статус – це відображення душі людини, а не дешевий пафос."`
    }, {
        cytata:`"Так буває ми любимо тих, хто нас не любе, А люди инколи бувають гірше собак…"`
    }, {
        cytata:`"Якщо будеш мной зловживати зловиш передоз!"`
    }, {
        cytata:`"Насправді, життя просте, але ми наполегливо його ускладнюєм. Конфуций"`
    }, {
        cytata:`"Хто мало хоче, той дешево стоїть."`
    }, {
        cytata:`"Веди мене, слідуй за мною або йди з мого шляху"`
    }, {
        cytata:`"Не вчасно може бути тільки ікота, менструація, смерть чи сусідка. Але не любов"`
    }, {
        cytata:`"В світі так багато прекрасного, що інколи я думаю, що я не звідси. Джонні Депп"`
    }, {
        cytata:`"Тут повинна була бути класна цитата, але сьогодні мені лінь"`
    }, {
        cytata:`"Продам душу. Дорого."`
    }, {
        cytata:`"Люди, как свічки — одні горять, інші — ректальні."`
    }, {
        cytata:`"Все пройде… І це тоже"`
    }, {
        cytata:`"Вдягаю рожеві окуляри, щоб прикрисить твій сірий світ хоча б в своїх очах"`
    }, {
        cytata:`"Нє важно шо кажуть криси, ща спиной у кіси!"`
    }];

    let btn = document.querySelector("#button");
    let cytata = document.querySelector(".text_quote");

    btn.addEventListener("click", () => {
        let random = Math.floor(Math.random() * cytaty.length);
        cytata.innerHTML = cytaty[random].cytata;

        var defaults = {
            spread: 360,
            ticks: 50,
            gravity: 0,
            decay: 0.94,
            startVelocity: 30,
            colors: ['FFE400', 'FFBD00', 'E89400', 'FFCA6C', 'FDFFB8']
          };
          
          function shoot() {
            confetti({
              ...defaults,
              particleCount: 40,
              scalar: 1.2,
              shapes: ['star']
            });
          
            confetti({
              ...defaults,
              particleCount: 10,
              scalar: 0.75,
              shapes: ['circle']
            });
          }
          
          setTimeout(shoot, 0);
          setTimeout(shoot, 100);
          setTimeout(shoot, 200);
      });



